Revit 2026 API

# BuiltInFailuresSweepFailures Class

---

Failures about Sweep.

SystemObject Autodesk.Revit.DBBuiltInFailuresSweepFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SweepFailures
```
```vb
Public NotInheritable Class SweepFailures
```
```cpp
public ref class SweepFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SweepFailures = class end
```

The BuiltInFailuresSweepFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawSweep | Can't create sweep. |
|  | ComplexPathWithComplexProfile | Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines. |
|  | ProfileLoopEmpty | Profile sketch is empty! |
|  | SweepFailed | Proper sweep geometry creation failed. |
|  | SweepFailedError | Proper sweep geometry creation failed. |
|  | WallSweepInconsistent | The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements. |

#### Reference

Autodesk.Revit.DB Namespace